load-test.yml
config:
  target: http://localhost:8080/v1
  phases:
    - name: "Warm-up Phase"
      duration: 10s
      arrivalRate: 2
      rampTo: 5

    # - name: "Normal Load Phase"
    #   duration: 10s
    #   arrivalRate: 20

    # - name: "Peak Load Phase"
    #   duration: 10s
    #   arrivalRate: 40

    # - name: "Stress Test Phase"
    #   duration: 10s
    #   arrivalRate: 80

    # - name: "Recovery Phase"
    #   duration: 10s
    #   arrivalRate: 10

scenarios:
  - name: general_flow
    weight: 25
    flow:
      - post:
          url: /auth/login
          json:
            phone: "{{ $processEnvironment.TEST_USER_PHONE }}"
            password: "{{ $processEnvironment.TEST_USER_PASSWORD }}"
          headers:
            Content-Type: application/json
          capture:
            - json: "$.data.accessToken"
              as: "authToken"
            - json: "$.data.refreshToken"
              as: "refreshToken"

      - post:
          url: /auth/refresh
          json:
            refreshToken: "{{ refreshToken }}"
          headers:
            Content-Type: application/json

      - get:
          url: /news

      - get:
          url: /blog

      - get:
          url: /address/province

  - name: customer_flow
    weight: 25
    flow:
      - post:
          url: /auth/login
          json:
            phone: "{{ $processEnvironment.TEST_USER_PHONE }}"
            password: "{{ $processEnvironment.TEST_USER_PASSWORD }}"
          headers:
            Content-Type: application/json
          capture:
            - json: "$.data.accessToken"
              as: "authToken"
            - json: "$.data.refreshToken"
              as: "refreshToken"

      - post:
          url: /user/installation/request
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "{{ $randomString(10) }}"
            area: 100
            power: 5000
            maxCost: 15000.00
            buildingType: 1
            description: "Residential solar panel installation for 5kW system"
            provinceID: 1
            cityID: 5
            streetAddress: "123 Main Street"
            postalCode: "12345"
            houseNumber: "A-15"
            unit: 2
      - get:
          url: /user/installation/request
          headers:
            Authorization: "Bearer {{ authToken }}"

      - get:
          url: /user/installation/request/{{ $processEnvironment.TEST_INSTALLATION_REQUEST_ID }}/bid
          headers:
            Authorization: "Bearer {{ authToken }}"

      - get:
          url: /user/installation/panel
          headers:
            Authorization: "Bearer {{ authToken }}"

      - post:
          url: /user/maintenance/request
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            panelID: 1
            corporationID: 1
            subject: "{{ $randomString(20) }}"
            description: "Maintenance request for solar panel installation - {{ $randomString(50) }}"
            urgencyLevel: 1
            isUsingGuarantee: false

      - get:
          url: /user/maintenance/request
          headers:
            Authorization: "Bearer {{ authToken }}"

thresholds:
  http_req_duration:
    - p95 < 500ms
    - p99 < 1000ms

  http_req_failed:
    - rate < 0.01

  http_reqs:
    - rate > 100